Series

In [2]:
import pandas as pd
x=[3,4,5,2,6,7,8]
var=pd.Series(x)
print(var)
print(type(var))

0    3
1    4
2    5
3    2
4    6
5    7
6    8
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
import pandas as pd
x=[3,4,5,6]
var = pd.Series(x,index=['a','b','c','d'],dtype="float", name="python")
print(var)
print(type(var))
print(var[2])

a    3.0
b    4.0
c    5.0
d    6.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>
5.0

In [4]:
dic = {"name":['python','c','c++','java'],"property":[12,13,14,15],"rank":[1,4,3,2]}
var1 = pd.Series(dic)
var1

name        [python, c, c++, java]
property          [12, 13, 14, 15]
rank                  [1, 4, 3, 2]
dtype: object

In [5]:
s = pd.Series(12)
print(s)
print(type(s))

0    12
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
s1=pd.Series(12,index=[1,2,3,4,5,6,7])
s2=pd.Series(12,index=[1,2,3,4,5])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6     NaN
7     NaN
dtype: float64

Data Frame

In [7]:
import pandas as pd
l=[1,2,3,4,5,6]
var=pd.DataFrame(l)
print(type(var))

<class 'pandas.core.frame.DataFrame'>

In [8]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5]}
var1=pd.DataFrame(d)
print(var1)
print(type(var1))

   a  s
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
<class 'pandas.core.frame.DataFrame'>

In [9]:
# columns
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5]}
var1 = pd.DataFrame(d,columns=["a"])
print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a
0  1
1  2
2  3
3  4
4  5

In [10]:
# columns add 
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}
var1 = pd.DataFrame(d,columns=["a",1])
print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  1
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [12]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}
var1 = pd.DataFrame(d,columns=["a",1], index=["a","s","d","f","g"])
print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  1
a  1  1
s  2  2
d  3  3
f  4  4
g  5  5

In [13]:
# value gate
d={"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}
var1 =pd.DataFrame(d)
print(type(var1))
print(var)
print(var1["a"][3])

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5
5  6
4

In [14]:
list_1 =[[1,2,3,4,5],[11,12,13,14,15]]
var2 = pd.DataFrame(list_1)
print(type(var2))
print(var2)

<class 'pandas.core.frame.DataFrame'>
    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

In [15]:
sr ={"s":pd.Series([1,2,3,4]),"r":pd.Series([1,2,3,4])}
var3 = pd.DataFrame(sr)
print(type(var3))
print(var3)

<class 'pandas.core.frame.DataFrame'>
   s  r
0  1  1
1  2  2
2  3  3
3  4  4

Arithmetic Operations

In [17]:
import pandas as pd
var=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [19]:
var["C"]=var["A"]+var["B"]
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [20]:
var["C"]=var["A"]-var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [21]:
var["C"]=var["A"]*var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [23]:
var["C"]=var["A"] / var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [30]:
var1=pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})
var1

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

In [32]:
var1["python"] = var1["A"]<=20
var1["python_1"] =var1["B"]>=17
var1

    A   B  python  python_1
0  10  15    True     False
1  20  16    True     False
2  30  17   False      True
3  40  18   False      True

Delete and Insert Functions

In [34]:
import pandas as pd
var =pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [35]:
var.insert(1,"python", var["A"])
var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5